{
  "backend/main.mo": "Motoko canister managing user profiles, mod settings, item spawner, and process selector with authorization checks and CRUD operations.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to source files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten file summaries describing roles of frontend components, hooks, state modules, assets, and build guides.",
  "frontend/ANDROID_APK_BUILD.md": "Guide explaining how to build and install an Android TWA/APK version of the app, including Meta Quest–specific notes.",
  "frontend/index.css": "Tailwind-based global styling with OKLCH theme variables, dark mode values, and VR-specific adjustments.",
  "frontend/index.html": "Minimal HTML shell loading the app with VR-friendly viewport settings and PWA manifest link.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, icons, startup settings, theme colors, and shortcuts.",
  "frontend/src/App.tsx": "Root React component applying VR-browser styling, authentication gating, dynamic backgrounds, and rendering the mod menu.",
  "frontend/src/components/ApkBuildInstructionsOverlay.tsx": "UI dialog that displays detailed TWA/APK build instructions for packaging the web app into an Android APK.",
  "frontend/src/components/AppToAppLauncherPanel.tsx": "Provides a UI for launching an external app via deep links, with environment checks and error handling for Android/Quest.",
  "frontend/src/components/AuthGate.tsx": "Handles authentication flow using Internet Identity, including login, profile checking, and gating access to children.",
  "frontend/src/components/DownloadsPanel.tsx": "Shows APK download availability, Meta Quest guidance, and an overlay for build instructions.",
  "frontend/src/components/ModStatusBar.tsx": "Displays active mod statuses as badges based on current mod settings.",
  "frontend/src/components/PrefabListPanel.tsx": "Loads and filters a prefab catalog, showing searchable prefab entries with copy-to-clipboard support.",
  "frontend/src/components/ProcessSelectorPanel.tsx": "UI panel that loads available processes, displays the selected process, and allows refreshing and changing the target process.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Dialog for creating a new user profile with name input and default settings, saving via backend mutation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useAppToAppLink.ts": "Manages a persistently stored deep link string with setters and a reset-to-default option.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, logout, and identity persistence.",
  "frontend/src/hooks/useItemSpawner.ts": "Fetches item spawner data, adds items via backend mutation, and tracks local spawn logs.",
  "frontend/src/hooks/useModSettings.ts": "Loads and updates mod settings by syncing with backend and storing some client-only settings locally.",
  "frontend/src/hooks/usePrefabCatalog.ts": "Fetches a static JSON catalog of prefabs from assets using react-query.",
  "frontend/src/hooks/useProcessSelector.ts": "Loads and updates the selected process using backend queries and mutations.",
  "frontend/src/hooks/useQueries.ts": "Defines react-query hooks for user profiles, item spawner, process selector, and available processes using the backend actor.",
  "frontend/src/hooks/useRuntimeEnv.ts": "Detects platform and browser characteristics from the user agent and exposes runtime environment flags.",
  "frontend/src/index.css": "Defines Tailwind layers, light/dark theme CSS variables, background utilities, and mobile/VR browser optimizations.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider, importing global styles.",
  "frontend/src/pages/ModMenuPage.tsx": "UI page for the mod menu including settings controls, item spawning, process selection, and status display.",
  "frontend/src/state/modSettings.ts": "Defines the mod settings model, defaults, and helpers for clamping and storing settings in localStorage.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and persisting URL parameters using URLSearchParams and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind config extending theme colors, typography, animations, and desert-themed palettes.",
  "project_state.json": "Project metadata detailing Meta Quest 3S compatibility goals, features, and requirements."
}