{
  "backend/main.mo": "Motoko canister managing user profiles, mod settings, item spawner, and process selector with access control.",
  "feature_evidence.json": "Feature evidence report mapping features to affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of major frontend files and hooks.",
  "frontend/ANDROID_APK_BUILD.md": "Guide explaining how to build an Android APK using Bubblewrap and TWA, including Quest-specific notes.",
  "frontend/index.css": "Global Tailwind-based theme defining color tokens and light/dark mode styling.",
  "frontend/index.html": "HTML entry point configuring page title, manifest, viewport, and mounting root.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining browser app metadata, colors, icons, and shortcuts.",
  "frontend/src/App.tsx": "Root React component rendering the BrowserPage and toast system.",
  "frontend/src/components/ApkBuildInstructionsOverlay.tsx": "Empty placeholder component file.",
  "frontend/src/components/AppToAppLauncherPanel.tsx": "Empty placeholder component file.",
  "frontend/src/components/AuthGate.tsx": "Authentication wrapper handling II login, profile setup flow, and logout behavior.",
  "frontend/src/components/DownloadsPanel.tsx": "Empty placeholder component file.",
  "frontend/src/components/ModStatusBar.tsx": "Displays active mod settings with badges, counting enabled mods and showing their parameters.",
  "frontend/src/components/PrefabListPanel.tsx": "Fetches and filters a prefab catalog, providing search, copy-to-clipboard, and various loading/error states.",
  "frontend/src/components/ProcessSelectorPanel.tsx": "Shows available game processes, allows selecting one, and supports refreshing and handling missing selections.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Collects a user name and initializes a default profile through a save mutation with success/error feedback.",
  "frontend/src/hooks/useActor.ts": "Creates and maintains a backend actor tied to identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAppToAppLink.ts": "Manages a persistent deep link value stored in localStorage with setters and reset capability.",
  "frontend/src/hooks/useBrowserHistory.ts": "Implements simple in‑memory browser-like navigation with back, forward, and go functions.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, managing login, stored identities, and status tracking.",
  "frontend/src/hooks/useItemSpawner.ts": "Retrieves item spawner data and adds items while keeping a local log of spawn actions.",
  "frontend/src/hooks/useModSettings.ts": "Manages mod settings by syncing backend profile data with localStorage and providing update helpers.",
  "frontend/src/hooks/usePrefabCatalog.ts": "Fetches a static prefab catalog JSON file using react-query.",
  "frontend/src/hooks/useProcessSelector.ts": "Loads and updates the selected process via backend queries with simple error handling.",
  "frontend/src/hooks/useQueries.ts": "Wraps various backend actor calls with react-query hooks for profiles, items, and process management.",
  "frontend/src/hooks/useRuntimeEnv.ts": "Detects runtime environment details like Android, Quest Browser, and VR mode from the user agent.",
  "frontend/src/index.css": "Defines Tailwind layers and color variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/BrowserPage.tsx": "Implements an in-app browser with navigation controls and an iframe for loading URLs.",
  "frontend/src/pages/ModMenuPage.tsx": "Empty file placeholder for a mod menu page.",
  "frontend/src/state/modSettings.ts": "Defines mod settings defaults and utilities for clamping and persisting client-side settings.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, storing, and managing URL and session parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, color mappings, and plugin setup.",
  "project_state.json": "Defines the project state for a laptop‑only 2D web‑browser‑style app with iframe loading, listing existing features, a pending feature request, and metadata about versions and notes."
}