{
  "backend/main.mo": "Main actor implementing user profiles, mod settings, spawners, and process selection with authorization checks and update/query methods.",
  "backend/migration.mo": "Migration module converting old user profiles and settings into the new schema with updated spawner and mod settings fields.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to frontend files, components, and test IDs with confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing purposes of all major frontend files including components, hooks, panels, and assets.",
  "frontend/ANDROID_APK_BUILD.md": "Guide explaining how to package the web app as an Android APK using Bubblewrap TWA, including prerequisites and build steps.",
  "frontend/index.css": "Global Tailwind-based styling defining color tokens, themes, and desert-themed palettes plus rainbow animation support.",
  "frontend/index.html": "HTML entry point setting title, manifest reference, and mounting root element for the web app.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, theming, icons, and shortcuts for installation and TWA compatibility.",
  "frontend/src/App.tsx": "Main React entry component wrapping ModMenuPage with AuthGate and displaying global notifications.",
  "frontend/src/components/ApkBuildInstructionsOverlay.tsx": "Empty placeholder component file for APK build instruction UI.",
  "frontend/src/components/AppToAppLauncherPanel.tsx": "Empty placeholder component file for app-to-app launcher panel UI.",
  "frontend/src/components/AuthGate.tsx": "Handles authentication flow, showing login, loading, profile setup, or app content based on user identity and profile state.",
  "frontend/src/components/DownloadsPanel.tsx": "Empty placeholder component with no implemented content.",
  "frontend/src/components/ItemSpawnerPanel.tsx": "Provides UI to add, remove, clear, and spawn custom items while logging spawn actions.",
  "frontend/src/components/ModStatusBar.tsx": "Displays active mod settings as badges and shows the total number of enabled mods.",
  "frontend/src/components/PrefabListPanel.tsx": "Shows a searchable prefab catalog with filtering and clipboard copy support, handling loading and error states.",
  "frontend/src/components/PrefabSpawnerPanel.tsx": "Allows searching prefab catalog, adding prefabs to the spawn list, spawning them, and clearing all prefabs.",
  "frontend/src/components/ProcessSelectorPanel.tsx": "Displays available processes, allows selecting a target process, and supports refreshing the process list.",
  "frontend/src/components/ProfileSetupDialog.tsx": "UI dialog for creating a user profile, capturing a name and initializing default profile fields.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAppToAppLink.ts": "Stores and updates a deep link string in localStorage with reset and setter helpers.",
  "frontend/src/hooks/useBrowserHistory.ts": "Implements a simple in-memory browser history with go, back, forward, and reload handlers.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, managing login, logout, stored identities, and related state.",
  "frontend/src/hooks/useItemSpawner.ts": "Fetches item spawner data and exposes an add-item mutation with loading state.",
  "frontend/src/hooks/useModSettings.ts": "Loads, merges, and updates mod settings across backend and localStorage, exposing a unified settings state.",
  "frontend/src/hooks/usePrefabCatalog.ts": "Fetches a static prefab catalog JSON file and returns it via react-query.",
  "frontend/src/hooks/useProcessSelector.ts": "Reads and updates the selected backend process with error handling.",
  "frontend/src/hooks/useQueries.ts": "Collection of react-query hooks for user profile, mod settings, item spawner, and process operations against the backend actor.",
  "frontend/src/hooks/useRuntimeEnv.ts": "Detects device and browser environment flags from the user agent string.",
  "frontend/src/index.css": "Sets up Tailwind layers, theme variables for light/dark modes, base styles, and a rainbow background animation.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity context, importing global styles.",
  "frontend/src/pages/BrowserPage.tsx": "Implements an in‑app browser with URL input, navigation controls, and an iframe rendering the target page.",
  "frontend/src/pages/ModMenuPage.tsx": "Renders the mod menu UI including status, process selector, movement mods, and settings controls with themed layout.",
  "frontend/src/state/modSettings.ts": "Defines mod settings structure, defaults, clamping, and helpers for storing and retrieving settings from localStorage.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, persisting, and clearing URL parameters using both URL and sessionStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, animations, themes, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines overall project state for a mod menu with cheat toggles, spawners, visual effects, and process selection, plus required cover art. Lists all existing features with IDs, requirement links, and versions."
}