{
  "kind": "build_request",
  "title": "Laptop-only 2D web browser UI (URL bar + iframe navigation)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Replace the current mod-menu/authenticated UI with a laptop-only (2D) web-browser-style interface that can load external websites inside an iframe, including a URL bar and basic navigation controls (Back, Forward, Reload, Go).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5",
          "msg-7",
          "msg-9"
        ],
        "quotes": [
          "make me  web browser that can go on any website",
          "a Laptop Web browser",
          "only the laptop"
        ]
      },
      "acceptanceCriteria": [
        "App renders a browser-like layout on desktop/laptop screens with a top navigation bar and a main content area.",
        "URL input supports entering a domain or full URL; if protocol is missing, the app prepends https:// before loading.",
        "Clicking Go (or pressing Enter in the URL bar) loads the requested URL in an iframe.",
        "Back/Forward navigate through the app-managed history of visited URLs (those entered via the URL bar).",
        "Reload re-loads the currently displayed URL in the iframe.",
        "All user-facing text is in English."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the app has no VR mode and does not show VR/Quest/APK/mod-menu UI elements; the experience must be laptop-only 2D.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-9"
        ],
        "quotes": [
          "only the laptop"
        ]
      },
      "acceptanceCriteria": [
        "No VR-specific panels, downloads/APK instructions, app-to-app launcher, mod menu, or Internet Identity login screens are presented in the primary UI flow.",
        "The UI works in a normal desktop browser without requiring authentication to access the browser interface."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update the app’s shell branding to match the laptop web browser experience (HTML title and PWA manifest name/description).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5",
          "msg-9"
        ],
        "quotes": [
          "make me  web browser that can go on any website",
          "only the laptop"
        ]
      },
      "acceptanceCriteria": [
        "The document title (frontend/index.html) reflects the new browser app name (not the previous mod menu title).",
        "frontend/public/manifest.webmanifest name/short_name/description reflect the new browser app (not the previous mod menu/Quest/APK messaging)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Apply a coherent visual theme suitable for a laptop web browser UI (colors, typography, spacing, component styling) and use it consistently across the browser page.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7",
          "msg-9"
        ],
        "quotes": [
          "a Laptop Web browser",
          "only the laptop"
        ]
      },
      "acceptanceCriteria": [
        "Browser chrome (top bar, buttons, input) uses a consistent style system (e.g., neutral ‘graphite’ UI with one accent color) and remains readable and accessible.",
        "Layout is responsive for typical laptop widths and keeps the iframe usable (no overflow issues)."
      ]
    }
  ],
  "constraints": [
    "Frontend must not edit files under frontend/src/components/ui (compose existing Shadcn components instead).",
    "Frontend must not modify immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Backend must remain a single Motoko actor in backend/main.mo; do not introduce additional backend services."
  ],
  "nonGoals": [
    "Implementing a fully unrestricted browser (bypassing sites that block iframe embedding).",
    "VR mode, Quest Browser optimizations, or APK/TWA build/download flows.",
    "WebSockets/real-time features, third-party auth providers, or external databases."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}