{
  "kind": "build_request",
  "title": "Make the app runnable on Meta Quest 3S (Quest Browser + Android APK/TWA)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add explicit Meta Quest 3S support guidance in the UI, covering both (a) running the app in the Meta Quest (Oculus/Quest) Browser as a PWA and (b) installing/running the Android APK wrapper on Quest (Android) where applicable.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "I want you to make it so a MetaQuest 3S VR can run this app."
        ]
      },
      "acceptanceCriteria": [
        "The app UI contains a clearly labeled section (or additions to existing Downloads / instructions UI) that mentions Meta Quest 3S by name and explains how to open the app in Quest Browser.",
        "The guidance also explains the Android APK/TWA option in Quest terms (Android-based headset), including the prerequisite that the web app must be reachable via HTTPS and the manifest must be accessible at /manifest.webmanifest.",
        "All user-facing text is in English."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the existing APK download experience to be accurate for Meta Quest (Android) devices: remove Samsung-only wording and replace it with wording that includes Meta Quest headsets as supported Android devices where relevant.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "I want you to make it so a MetaQuest 3S VR can run this app."
        ]
      },
      "acceptanceCriteria": [
        "In the Downloads panel, the APK availability description does not state or imply 'Samsung-only' compatibility.",
        "The Downloads panel copy mentions Android devices and explicitly includes Meta Quest headsets (e.g., 'Android devices (including Meta Quest)').",
        "The APK download link path remains unchanged: /assets/apk/cactus-cowboy-mod-menu.apk."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Extend the embedded APK build instructions shown in the in-app build overlay to include a Meta Quest 3S section (Quest-specific install/run notes) without removing the existing Bubblewrap/TWA steps.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "I want you to make it so a MetaQuest 3S VR can run this app."
        ]
      },
      "acceptanceCriteria": [
        "The in-app build instructions overlay includes a distinct section titled for Meta Quest (e.g., 'Meta Quest 3S / Quest (Android) Notes').",
        "The new section explains, at minimum: Quest uses Android; the app can run via Quest Browser; and that an APK wrapper is an alternative packaging route if the user is distributing/installing an APK.",
        "Existing Bubblewrap/TWA instructions remain present and readable (not replaced)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Improve runtime environment detection so the app can recognize Meta Quest Browser sessions and show Quest-relevant messaging (e.g., treat Quest Browser as Android-capable for the App Launcher panel messaging, and optionally show 'Quest detected' helper text).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "I want you to make it so a MetaQuest 3S VR can run this app."
        ]
      },
      "acceptanceCriteria": [
        "When opened in a Quest Browser user agent, the app does not show misleading 'not Android' warnings for features that rely on Android (if Quest UA indicates Android/Quest Browser).",
        "Any Quest detection is performed purely client-side and does not require backend changes.",
        "If Quest cannot support a feature (e.g., deep-link app switching limitations), the UI displays a clear, actionable message rather than failing silently."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Ensure the app is comfortable and usable in a VR browser context by adding VR-friendly layout/accessibility adjustments (larger readable base text, safe tap/click targets, and avoiding interaction blockers) while preserving the current overall layout and feature set.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "I want you to make it so a MetaQuest 3S VR can run this app."
        ]
      },
      "acceptanceCriteria": [
        "In Quest Browser, primary controls (buttons, switches, sliders, inputs) are readable and interactable without requiring zoom.",
        "No critical UI is clipped off-screen on typical Quest Browser viewport sizes; scrolling works reliably in ScrollArea regions.",
        "Any new styling adjustments are implemented in app-owned styles/components (not by editing read-only UI component sources under frontend/src/components/ui)."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Add/confirm appropriate viewport metadata for mobile/VR browsers in the HTML shell so the UI scales correctly on Meta Quest Browser.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "I want you to make it so a MetaQuest 3S VR can run this app."
        ]
      },
      "acceptanceCriteria": [
        "The HTML entry document includes a viewport meta tag appropriate for mobile browsers (so the app is not rendered at desktop scale on Quest).",
        "The change does not add user-visible navigation or reliance on standalone HTML pages; index.html remains a minimal React mount shell."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/components/ui (read-only Shadcn UI sources).",
    "Do not modify frontend immutable hook entrypoints (frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx).",
    "Backend must remain a single Motoko actor in backend/main.mo; do not introduce additional backend services.",
    "Do not change the APK download path (/assets/apk/cactus-cowboy-mod-menu.apk)."
  ],
  "nonGoals": [
    "Implementing a native Meta Quest OpenXR/WebXR immersive VR scene or 3D mode (this request is about running the existing app on Quest).",
    "Adding third-party authentication providers beyond Internet Identity.",
    "Adding real-time features (WebSockets/push notifications) or external databases/services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}