{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Laptop-only 2D web browser UI (URL bar + iframe navigation)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Implement a desktop/laptop 2D browser-like UI with URL bar, iframe navigation, and app-managed history controls.",
      "acceptanceCriteria": [
        "App renders a browser-like layout on desktop/laptop screens with a top navigation bar and a main content area.",
        "URL input supports entering a domain or full URL; if protocol is missing, the app prepends https:// before loading.",
        "Clicking Go (or pressing Enter in the URL bar) loads the requested URL in an iframe.",
        "Back/Forward navigate through the app-managed history of visited URLs (those entered via the URL bar).",
        "Reload re-loads the currently displayed URL in the iframe.",
        "All user-facing text is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/BrowserPage.tsx",
          "operation": "create",
          "description": "Create the primary laptop-only 2D browser page: top chrome (Back/Forward/Reload, URL input, Go) and a main iframe area. Use shadcn/ui components (e.g., Button, Input) to build the chrome controls; verify the component's usage instructions before implementing. Implement URL normalization (prepend https:// when protocol missing), Enter-to-Go, app-managed history stack, and Reload via iframe remount/key update without altering the URL."
        },
        {
          "path": "frontend/src/hooks/useBrowserHistory.ts",
          "operation": "create",
          "description": "Add a small hook to manage app-level navigation state: current URL, back/forward stacks, and helper actions (go/back/forward/reload trigger). Keep it isolated to frontend state (no authentication, no backend calls)."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the new BrowserPage into the app as the primary UI (replace current AuthGate + ModMenuPage render). Ensure the BrowserPage is the default rendered view so it is reachable with no additional navigation steps."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Remove VR/Quest/APK/mod-menu/authentication gating from the primary UI so the experience is laptop-only 2D.",
      "acceptanceCriteria": [
        "No VR-specific panels, downloads/APK instructions, app-to-app launcher, mod menu, or Internet Identity login screens are presented in the primary UI flow.",
        "The UI works in a normal desktop browser without requiring authentication to access the browser interface."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Remove VR browser markers/styling toggles and remove authentication gating from the primary flow (do not render AuthGate). Ensure no Quest/VR-specific UI is conditionally shown and the browser interface is accessible immediately on load."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Remove/neutralize VR-specific CSS rules (e.g., selectors based on a VR marker attribute) and any Quest/VR optimizations that alter layout/typography for VR mode, ensuring the experience remains standard desktop 2D."
        },
        {
          "path": "frontend/src/pages/ModMenuPage.tsx",
          "operation": "delete",
          "description": "Delete the mod-menu page implementation to prevent mod-menu UI from being shipped/accidentally wired back into the primary experience."
        },
        {
          "path": "frontend/src/components/DownloadsPanel.tsx",
          "operation": "delete",
          "description": "Delete the APK/downloads UI panel (Quest/APK messaging) so it cannot appear in the primary UI flow."
        },
        {
          "path": "frontend/src/components/ApkBuildInstructionsOverlay.tsx",
          "operation": "delete",
          "description": "Delete the APK/TWA build instructions overlay component to remove APK/Quest instructions from the app UI surface."
        },
        {
          "path": "frontend/src/components/AppToAppLauncherPanel.tsx",
          "operation": "delete",
          "description": "Delete the app-to-app launcher panel (Android/Quest deep-link switching UI) to keep the experience laptop-only 2D."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Update document title and PWA manifest branding to match the laptop web browser experience.",
      "acceptanceCriteria": [
        "The document title (frontend/index.html) reflects the new browser app name (not the previous mod menu title).",
        "frontend/public/manifest.webmanifest name/short_name/description reflect the new browser app (not the previous mod menu/Quest/APK messaging)."
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Update the HTML document title to a browser-style app name (English) and remove any mod-menu-specific naming."
        },
        {
          "path": "frontend/public/manifest.webmanifest",
          "operation": "modify",
          "description": "Update manifest name/short_name/description to the new laptop web browser experience (English). Remove mod-menu/VR/Quest/APK wording from description and update shortcuts metadata accordingly to match the browser app."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Apply a coherent, consistent, responsive laptop web browser visual theme across the browser page.",
      "acceptanceCriteria": [
        "Browser chrome (top bar, buttons, input) uses a consistent style system (e.g., neutral ‘graphite’ UI with one accent color) and remains readable and accessible.",
        "Layout is responsive for typical laptop widths and keeps the iframe usable (no overflow issues)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Adjust global CSS variables and base styles toward a neutral 'graphite' browser theme with a single accent color; ensure readable contrast, consistent spacing, and remove desert/rainbow background utilities from being the default page background if they interfere with a browser-like shell."
        },
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Align Tailwind theme extensions with the new browser chrome styling needs (neutral palette + one accent, subtle shadows/borders). Keep changes compatible with existing shadcn/ui theming."
        },
        {
          "path": "frontend/src/pages/BrowserPage.tsx",
          "operation": "modify",
          "description": "Refine BrowserPage layout/styling for a browser-like chrome: consistent button sizes, input styling, spacing, and a responsive layout that preserves a large iframe area without overflow. Use shadcn/ui components (e.g., Button, Input, Separator/Tooltip if available) for consistent styling; verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}